#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # azurerm_static_site.site[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_static_site" "site" {
      [32m+[0m [0m[1m[0mapi_key[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mdefault_host_name[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m            = "centralus"
      [32m+[0m [0m[1m[0mname[0m[0m                = "CRC-Client-Dev-PR"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m = "crc-dev"
      [32m+[0m [0m[1m[0msku_size[0m[0m            = "Free"
      [32m+[0m [0m[1m[0msku_tier[0m[0m            = "Free"
    }

[0m[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @charliedalldorf, Action: `pull_request`*